tap "buo/cask-upgrade"
tap "cjbassi/gotop"
tap "domt4/autoupdate"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"

# Fish completion for brew-cask
brew "brew-cask-completion"

# Modern replacement for 'ls'
brew "exa"

# Banner-like program prints strings as ASCII art
brew "figlet"

# Command-line fuzzy finder written in Go
brew "fzf"

# Distributed revision control system
brew "git"

# Alternative to top/htop
brew "glances"

# GNU implementation of the famous stream editor
brew "gnu-sed"

# GNU grep, egrep and fgrep
brew "grep"

# Improved top (interactive process viewer)
brew "htop"

# Display an interface's bandwidth usage
brew "iftop"

# Calculate various network masks, etc. from a given IP address
brew "ipcalc"

# Lazier way to manage everything docker
brew "lazydocker"

# Show markdown documents on text terminals
brew "mdcat"

# Free (GNU) replacement for the Pico text editor
brew "nano"

# Interactive cheatsheet tool for the command-line
brew "navi"

# NCurses Disk Usage
brew "ncdu"

# Fast, highly customisable system info script
brew "neofetch"

# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"

# Utility for managing network connections
brew "netcat"

# Port scanning utility for large networks
brew "nmap"

# Platform built on V8 to build network applications
brew "node"

# Powerful, clean, object-oriented scripting language
brew "ruby", link: true

# Install various Ruby versions and implementations
brew "ruby-build"

# Yet another network load monitor
brew "slurm"

# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"

# Programmatically correct mistyped console commands
brew "thefuck"

# Simplified and community-driven man pages
brew "tldr"

# Terminal multiplexer
brew "tmux"

# CLI tool that moves files or folder to the trash
brew "trash"

# Display directories as trees (with optional color/HTML output)
brew "tree"

# Digital clock in ncurses
brew "tty-clock"

# Command-line unarchiving tools supporting multiple formats
brew "unar"

# Internet file retriever
brew "wget"

# Download YouTube videos from the command-line
brew "youtube-dl"

# UNIX shell (command interpreter)
brew "zsh"

# A terminal based graphical activity monitor inspired by gtop and vtop
brew "cjbassi/gotop/gotop"

# Tools for building Android applications
cask "android-studio"

# Backup and restore SD cards, USB drives, external HDD, etc
cask "applepi-baker"

# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"

# E-books management software
cask "calibre"

# Server and cloud storage browser
cask "cyberduck"

# App to build and share containerized applications and microservices
cask "docker"

# terminal fonts that support powerline fonts
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "font-ibm-plex"
cask "font-source-code-pro"

# Development kit for the Java programming language
cask "java"

# Display key code, unicode value and modifier keys state for any key combination
cask "key-codes"

# Collaboration platform for API development
cask "postman"

# Peer to peer Bitorrent client
cask "qbittorrent"

# QuickLook plug-in that renders source code with syntax highlighting
cask "qlcolorcode"

# QuickLook generator for Markdown files
cask "qlmarkdown"

# A QuickLook plugin that lets you view plain text files without a file extension
cask "qlstephen"

# A QuickLook plugin for CSV files 
cask "quicklook-csv"

# Imaging utility to install operating systems to a microSD card
cask "raspberry-pi-imager"

# Standalone app for debugging React Native apps
cask "react-native-debugger"

# Instant messaging application focusing on security
cask "signal"

# Sets a minimum speed for built-in fans
cask "smcfancontrol"

# Music streaming service
cask "spotify"

# Text editor for code, markup and prose
cask "sublime-text"

# Application for inspecting installer packages
cask "suspicious-package"

# Unpacks archive files
cask "the-unarchiver"

# Web browser focusing on security
cask "tor-browser"

# Free and open-source hosted hypervisor for x86 virtualization
cask "virtualbox"

# AMD64/Intel64 and x86 virtualization
cask "virtualbox-extension-pack"

# Open-source code editor
cask "visual-studio-code"

# Remote desktop application focusing on security
cask "vnc-viewer"

# Network protocol analyzer
cask "wireshark"

# Multi-platform graphical interface for official Nmap Security Scanner
cask "zenmap"
